/**
 * Created by signiliance on 2017/8/17.
 */


8月11日网易游戏（33分钟）
块级元素和行内元素的区别
行内块级元素是什么东西？
HTML语义化的理解和作用
盒子模型 元素的水平和垂直居中 三栏布局，左右定宽，中间自适应
JavaScript的基本数据类型，
0 == null吗？为什么？
AJAX实现原理
跨域怎么做
移动端怎么做优化？
动画如何做加速？
如何做首屏加速的？
移动端适配的3种方案
单页应用的路由内部原理怎么做的？
自己实现过SPA吗？
了解过canvas和WebGL吗？
如果让你做IE7兼容，你怎么做？（从html,css,js方面说）
我们网易游戏要做一个交互性很强的移动端界面，你有什么思路吗？
8月15号有赞（18分钟）
介绍项目，技术难点 性能优化
图片懒加载怎么做的（getBoundingClientRect）
懒加载的滚动如何做优化（函数节流）
cookie除了key与value还有哪些参数
做过后端吧？如何判断区分一个用户的身份？
session的生成规则？sessionid的生成规则？
8月16号CVTE（26分钟）
介绍项目 项目用REM布局吧？
REM如何做自适应的？
知道哪5种设计模式吗？
Vue双向绑定的原理（说了对象和数组的监测）
AMD是什么？解决什么问题？了解AMD,CMD,UMD吗？AMD与CMD的区别？啥叫依赖前置？
BootStrap的栅格系统实现原理？（说了bs3和bs4的）
什么是原型链 三栏布局，左右定宽，中间自适应（说了5种） 性能优化
8月17号百度-网页搜索部（52分钟）
自我介绍
项目都用Vue是吧，说说Vue的MVVM如何交互的？
知道Vue监测变量如何实现的吗？
VueRouter用哪些API实现的？改变hash参数会引起视图的更新吗？
说说你项目中实现的Dialog组件？提供了哪些API？如何设计这些API的？
用过AJAX吧？说说AJAX是干什么用的？如何实现AJAX？
说说你了解的垃圾回收机制 绑定事件有哪几种方式？
addEventListener有哪些参数？冒泡跟捕获有什么区别？
来道算法题吧，在一个数组中求连续最大的累加和
居中可以使用哪几个属性？不定宽度与定宽度如何居中？
啥是闭包？用来干嘛的？
CSS有了解过如何做动画吗？animation有哪些参数？
HTTP状态码
HTTP缓存
Git常用操作?merge与rebase有什么区别？
了解过linux吗？